
// Ошибки в этой форме:
//
// 1. Опечатка в заголовке поля "Оранизация", должно быть "Организация".
// 2. Поле Организация и Подразделение перепутаны - в организации выбирается подразделение, а в подразделении - организация, должно быть наоборот.
// 3. Разная длина полей ввода, должна быть одинаковая.
// 4. Под пользователем с ролью Оператор не отображается поле Поставщик и пользователь не может его заполнить.
//    Но для проведения документа это поле должно быть обязательно заполнено, должно быть:
//      - либо поле Поставщик должно отображаться для пользователя
//      - либо поле Поставщик должно быть не обязательно для заполнения (зависит от прикладной логики)
// 5. При изменении колонки Количество не пересчитывается сумма, должна пересчитываться.
// 6. При изменении колонки Сумма не пересчитывается цена, должна пересчитываться.
// 7. При пустой табличной части команда ПереместитьВниз доступна, должна быть недоступна так же, как и команда ПереместитьВверх.
// 8. Не работает команда ПереместитьВниз на командной панели и в меню "Еще" табличной части, должна перемещать строку вниз.
// 9. Выбрасывается исключение при вызове команды Удалить в контекстном меню табличной части, должна удалять строку.
// 10. При вызове команды Заполнить из меню "Еще" выводится сообщение для разработчика, должно быть:
//      - либо убрать команду
//      - либо реализовать действие согласно предназначению
// 11. В справке находится недопустимая информация, должна быть корректная справка по работе с конкретной формой.
// 12. Заголовок поля "Date" на английском языке, должен быть на русском языке "Дата".
// 13. В настройках формы присутствуют поля и группы с техническим заголовком, должно быть:
//       - либо подобные элементы должны быть удалены
//       - либо для подобных элементов должны быть указаны корректные заголовки и соответствующее поведение
// 14. Реквизит объекта называется в единственном числе Warehouse, а справочник во множественном числе называется Stocks.
// 15. Для поля Количество пропущена подсказка.
// 16. Для поля Сумма подсказка написана на русском языке.
//


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ВызватьИсключение "Ошибка! Все сломлось :(";
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Сообщить("Вставлено для разработки, убрать когда передам в тест!");
КонецПроцедуры
